In [1]:
# Importa a biblioteca do SQlite
import sqlite3

In [2]:
# Printa a versão Python utilizada neste exercício
from platform import python_version
print('Versão Python:', python_version())

Versão Python: 3.8.8

In [3]:
# Printa a versão utilizada do sqlite3
%reload_ext watermark
%watermark --iversions

sqlite3: 2.6.0

**1. Crie uma tabela chamada "alunos" com os seguintes campos: id (inteiro), nome (texto), idade (inteiro) e curso (texto).**

In [4]:
# Faz a conexão do arquivo python com o arquivo de BD criado no BDeaver
conexao = sqlite3.connect('banco_exercicio')

# Instancia o cursor
cursor = conexao.cursor()

# Cria a tabela alunos com as informações id, nome, idade e curso
cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(100));')

# Envia as alterações e encerra a conexão
conexao.commit()
conexao.close

**2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.**

In [5]:
# Inserindo os alunos
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(1, "Maria de Sousa", 24, "Letras")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(2, "José da Silva", 19, "Administração")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(3, "João Ferreira", 21, "Engenharia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(4, "Laura Batista", 22, "Análise e Desenvolvimento de Sistemas")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(5, "Rodrigo Oliveira", 23, "Biologia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(6, "Tatiana Santos", 20, "Engenharia")')

# Envia as alterações e encerra a conexão
conexao.commit()
conexao.close

**3. Consultas Básicas - Escreva consultas SQL para realizar as seguintes tarefas:**

In [6]:
# a) Selecionar todos os registros da tabela "alunos".**
alunos = cursor.execute('SELECT * FROM alunos')

for aluno in alunos:
    print(aluno)

(1, 'Maria de Sousa', 24, 'Letras')
(2, 'José da Silva', 19, 'Administração')
(3, 'João Ferreira', 21, 'Engenharia')
(4, 'Laura Batista', 22, 'Análise e Desenvolvimento de Sistemas')
(5, 'Rodrigo Oliveira', 23, 'Biologia')
(6, 'Tatiana Santos', 20, 'Engenharia')

In [7]:
# b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

alunos_maior20 = cursor.execute('SELECT * FROM alunos WHERE idade > 20')

for aluno in alunos_maior20:
    print(aluno)

(1, 'Maria de Sousa', 24, 'Letras')
(3, 'João Ferreira', 21, 'Engenharia')
(4, 'Laura Batista', 22, 'Análise e Desenvolvimento de Sistemas')
(5, 'Rodrigo Oliveira', 23, 'Biologia')

In [8]:
# c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética

alunos_engenharia = cursor.execute('SELECT * FROM alunos WHERE curso = "Engenharia" ORDER BY nome')
                                   
for aluno in alunos_engenharia:
    print(aluno)

(3, 'João Ferreira', 21, 'Engenharia')
(6, 'Tatiana Santos', 20, 'Engenharia')

In [9]:
# d) Contar o número total de alunos na tabela

cursor.execute('SELECT COUNT (*) FROM alunos')

# cursor.fetchone() recupera a próxima linha de um conjunto de resultados de consulta e retorna uma única sequência ou None
# se não houver mais linhas disponíveis.

num_alunos = cursor.fetchone()
print('A tabela contém um total de {} alunos.'.format(num_alunos[0]))

A tabela contém um total de 6 alunos.

**4. Atualização e Remoção**

In [10]:
# Replicando a tabela alunos antes das alterações
alunos = cursor.execute('SELECT * FROM alunos')

for aluno in alunos:
    print(aluno)

(1, 'Maria de Sousa', 24, 'Letras')
(2, 'José da Silva', 19, 'Administração')
(3, 'João Ferreira', 21, 'Engenharia')
(4, 'Laura Batista', 22, 'Análise e Desenvolvimento de Sistemas')
(5, 'Rodrigo Oliveira', 23, 'Biologia')
(6, 'Tatiana Santos', 20, 'Engenharia')

In [11]:
# a) Atualize a idade de um aluno específico na tabela.
cursor.execute('UPDATE alunos SET idade = 22 WHERE nome = "Maria de Sousa"')

conexao.commit()
conexao.close

In [12]:
# b) Remova um aluno pelo seu ID.
cursor.execute('DELETE FROM alunos WHERE nome = "Rodrigo Oliveira"')

conexao.commit()
conexao.close

In [13]:
# Print da tabela alunos após as alterações
alunos = cursor.execute('SELECT * FROM alunos')

for aluno in alunos:
    print(aluno)

(1, 'Maria de Sousa', 22, 'Letras')
(2, 'José da Silva', 19, 'Administração')
(3, 'João Ferreira', 21, 'Engenharia')
(4, 'Laura Batista', 22, 'Análise e Desenvolvimento de Sistemas')
(6, 'Tatiana Santos', 20, 'Engenharia')

**5. Criar uma Tabela e Inserir Dados**  
Crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float).    Insira alguns registros de clientes na tabela.

In [14]:
# Cria a tabela clientes com as informações id, nome, idade e saldo, indicando id como chave primária
cursor.execute('CREATE TABLE clientes (id INT PRIMARY KEY, nome VARCHAR(100), idade INT, saldo FLOAT);')

# Envia as alterações e encerra a conexão
conexao.commit()
conexao.close

In [15]:
# Inserindo clientes
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(1, "José Silva", 24, 500)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(2, "João Santos", 18, 150)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(3, "Antonio Oliveira", 35, 1050.62)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(4, "Francisco Sousa", 62, 854.79)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(5, "Carlos Rodrigues", 37, 3256.83)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(6, "Paulo Ferreira", 45, 238.43)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(7, "Helena Alves", 31, 1265.54)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(8, "Alice Pereira", 28, 835)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(9, "Laura Lima", 51, 1432.99)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(10, "Manuela Gomes", 26, 642)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(11, "Maria Luiza Costa", 33, 152)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(12, "Sarah Ribeiro", 20, 80)')

# Envia as alterações e encerra a conexão
conexao.commit()
conexao.close

In [16]:
# Verificando a tabela criada
clientes = cursor.execute('SELECT * FROM clientes')

for cliente in clientes:
    print(cliente)

(1, 'José Silva', 24, 500.0)
(2, 'João Santos', 18, 150.0)
(3, 'Antonio Oliveira', 35, 1050.62)
(4, 'Francisco Sousa', 62, 854.79)
(5, 'Carlos Rodrigues', 37, 3256.83)
(6, 'Paulo Ferreira', 45, 238.43)
(7, 'Helena Alves', 31, 1265.54)
(8, 'Alice Pereira', 28, 835.0)
(9, 'Laura Lima', 51, 1432.99)
(10, 'Manuela Gomes', 26, 642.0)
(11, 'Maria Luiza Costa', 33, 152.0)
(12, 'Sarah Ribeiro', 20, 80.0)

**6. Consultas e Funções Agregadas - Escreva consultas SQL para realizar as seguintes tarefas:**

In [17]:
# a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.
clientes_mais30 = cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')

for cliente in clientes_mais30:
    print(cliente)

('Antonio Oliveira', 35)
('Francisco Sousa', 62)
('Carlos Rodrigues', 37)
('Paulo Ferreira', 45)
('Helena Alves', 31)
('Laura Lima', 51)
('Maria Luiza Costa', 33)

In [18]:
# b) Calcule o saldo médio dos clientes
# Query que realiza o calculo da média de saldo dos clientes
cursor.execute('SELECT AVG(saldo) FROM clientes')

# cria variável com o retorno da query
saldo_medio = cursor.fetchone()

# printa a resposta
print('O saldo médio dos clientes é de R${:.2f}.'.format(saldo_medio[0]))

O saldo médio dos clientes é de R$871.52.

In [19]:
# c) Encontre o cliente com o saldo máximo.
cursor.execute('SELECT nome, MAX(saldo) FROM clientes')

maior_saldo = cursor.fetchone()

# printa a resposta
print(maior_saldo[0])

Carlos Rodrigues

In [20]:
# d) Conte quantos clientes têm saldo acima de 1000.
cursor.execute('SELECT COUNT (*) FROM clientes WHERE saldo > 1000')

clientes_1000 = cursor.fetchone()

print('A tabela possui {} clientes com saldo acima de 1000.'.format(clientes_1000[0]))

A tabela possui 4 clientes com saldo acima de 1000.

**7. Atualização e Remoção com Condições**

In [21]:
# Replicando a tabela clientes antes das alterações
clientes = cursor.execute('SELECT * FROM clientes')

for cliente in clientes:
    print(cliente)

(1, 'José Silva', 24, 500.0)
(2, 'João Santos', 18, 150.0)
(3, 'Antonio Oliveira', 35, 1050.62)
(4, 'Francisco Sousa', 62, 854.79)
(5, 'Carlos Rodrigues', 37, 3256.83)
(6, 'Paulo Ferreira', 45, 238.43)
(7, 'Helena Alves', 31, 1265.54)
(8, 'Alice Pereira', 28, 835.0)
(9, 'Laura Lima', 51, 1432.99)
(10, 'Manuela Gomes', 26, 642.0)
(11, 'Maria Luiza Costa', 33, 152.0)
(12, 'Sarah Ribeiro', 20, 80.0)

In [22]:
# a) Atualize o saldo de um cliente específico.
cursor.execute('UPDATE clientes SET saldo = 456 WHERE nome = "Sarah Ribeiro"')

conexao.commit()
conexao.close

In [23]:
# b) Remova um cliente pelo seu ID.
cursor.execute('DELETE FROM clientes WHERE ID = 5')

conexao.commit()
conexao.close

In [24]:
# A tabela clientes após as alterações efetuadas
clientes = cursor.execute('SELECT * FROM clientes')

for cliente in clientes:
    print(cliente)

(1, 'José Silva', 24, 500.0)
(2, 'João Santos', 18, 150.0)
(3, 'Antonio Oliveira', 35, 1050.62)
(4, 'Francisco Sousa', 62, 854.79)
(6, 'Paulo Ferreira', 45, 238.43)
(7, 'Helena Alves', 31, 1265.54)
(8, 'Alice Pereira', 28, 835.0)
(9, 'Laura Lima', 51, 1432.99)
(10, 'Manuela Gomes', 26, 642.0)
(11, 'Maria Luiza Costa', 33, 152.0)
(12, 'Sarah Ribeiro', 20, 456.0)

**8. Junção de Tabelas**  
Crie uma segunda tabela chamada "compras" com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real). Insira algumas compras associadas a clientes existentes na tabela "clientes".  
Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

In [25]:
# Cria a tabela compras com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id da tabela 
# "clientes"), produto (texto) e valor (real).
cursor.execute('CREATE TABLE compras (id INT, cliente_id INT, produto VARCHAR(100), valor REAL, PRIMARY KEY (id), FOREIGN KEY (cliente_id) REFERENCES clientes(id));')

# Envia as alterações e encerra a conexão
conexao.commit()
conexao.close

In [26]:
# Insira algumas compras associadas a clientes existentes na tabela "clientes".
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(1, 3, "mouse", 100)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(2, 8, "impressora", 650)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(3, 11, "mouse", 100)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(4, 4, "luminária", 50)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(5, 2, "tablet", 1500)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(6, 9, "notebook", 2500)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(7, 1, "monitor", 550)')
cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(8, 6, "teclado", 150)')

# Envia as alterações e encerra a conexão
conexao.commit()
conexao.close

In [27]:
# Verificando a tabela compras criada
compras = cursor.execute('SELECT * FROM compras')

for compra in compras:
    print(compra)

(1, 3, 'mouse', 100.0)
(2, 8, 'impressora', 650.0)
(3, 11, 'mouse', 100.0)
(4, 4, 'luminária', 50.0)
(5, 2, 'tablet', 1500.0)
(6, 9, 'notebook', 2500.0)
(7, 1, 'monitor', 550.0)
(8, 6, 'teclado', 150.0)

In [28]:
# Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.
# Retorna uma lista somente com os clientes que realizaram compra de produtos.
compras = cursor.execute('''SELECT nome, produto, valor clientes FROM clientes LEFT JOIN compras ON 
                         clientes.id = compras.cliente_id WHERE produto <> "None"''')

for compra in compras:
    print(compra)

('Antonio Oliveira', 'mouse', 100.0)
('Alice Pereira', 'impressora', 650.0)
('Maria Luiza Costa', 'mouse', 100.0)
('Francisco Sousa', 'luminária', 50.0)
('João Santos', 'tablet', 1500.0)
('Laura Lima', 'notebook', 2500.0)
('José Silva', 'monitor', 550.0)
('Paulo Ferreira', 'teclado', 150.0)